[
  "Honey never spoils. Archaeologists have found 3,000-year-old honey in Egyptian tombs that was still perfectly edible.",
  "Octopuses have three hearts. Two pump blood to the gills, and one pumps it to the rest of the body.",
  "A group of flamingos is called a 'flamboyance'.",
  "Bananas are technically berries, but strawberries are not.",
  "The Eiffel Tower can grow up to 6 inches taller during summer because heat causes the iron to expand.",
  "Sea otters hold hands while sleeping so they don't drift apart from each other.",
  "A day on Venus is longer than a year on Venus. It takes 243 Earth days to rotate once but only 225 to orbit the Sun.",
  "Cows have best friends and become stressed when they are separated from them.",
  "The shortest war in history lasted 38 to 45 minutes — between Britain and Zanzibar in 1896.",
  "Wombat droppings are cube-shaped, which prevents them from rolling away and helps mark territory.",
  "There are more possible iterations of a game of chess than there are atoms in the observable universe.",
  "A jiffy is an actual unit of time — it equals 1/100th of a second in computing.",
  "The heart of a blue whale is so large that a small child could crawl through its major arteries.",
  "Sharks have existed longer than trees. Sharks appeared about 400 million years ago; trees around 350 million years ago.",
  "Scotland's national animal is the unicorn.",
  "Astronaut footprints on the Moon will likely remain visible for at least 100 million years due to the lack of wind or weather.",
  "The inventor of the Pringles can, Fredric Baur, was buried in one after he passed away.",
  "A single strand of spaghetti is called a 'spaghetto'.",
  "Cleopatra lived closer in time to the Moon landing than to the construction of the Great Pyramid of Giza.",
  "The tongue of a blue whale weighs roughly as much as an adult elephant.",
  "A group of porcupines is called a 'prickle'.",
  "Humans share about 60% of their DNA with bananas.",
  "The total weight of all ants on Earth is estimated to be roughly equal to the total weight of all humans.",
  "A bolt of lightning is about five times hotter than the surface of the Sun.",
  "Oxford University is older than the Aztec Empire. Teaching existed at Oxford as early as 1096; the Aztec Empire began in 1428.",
  "Honey bees can recognize human faces.",
  "The Great Wall of China is not a single continuous wall — it's a series of walls and fortifications built over centuries.",
  "Your nose can detect over 1 trillion different scents.",
  "There are more stars in the universe than grains of sand on all of Earth's beaches.",
  "Butterflies taste with their feet.",
  "An octopus has nine brains — one central brain and a mini-brain in each of its eight arms.",
  "The dot over the letters 'i' and 'j' is called a 'tittle'.",
  "It rains diamonds on Saturn and Jupiter due to the extreme atmospheric pressure converting carbon into diamond.",
  "A cloud can weigh more than a million pounds, held aloft by rising air currents.",
  "Polar bear fur is actually transparent, not white. It appears white because it reflects visible light.",
  "The average cumulus cloud travels at about 30 miles per hour.",
  "Sloths can hold their breath longer than dolphins — up to 40 minutes by slowing their heart rate.",
  "There is enough gold in Earth's core to coat the entire surface of the planet in 1.5 feet of gold.",
  "A teaspoon of a neutron star would weigh about 6 billion tons.",
  "The Voyager 1 spacecraft is the farthest human-made object from Earth, currently over 15 billion miles away.",
  "Your body contains about 0.2 milligrams of gold, mostly dissolved in your blood.",
  "The Hawaiian alphabet has only 13 letters: 5 vowels and 8 consonants.",
  "A photon of light takes about 8 minutes to travel from the Sun to Earth, but it can take 100,000 years to travel from the Sun's core to its surface.",
  "Elephants are the only animals that can't jump.",
  "The wood frog can survive being frozen solid and then thaw back to life in the spring.",
  "The longest hiccuping spree lasted 68 years — Charles Osborne hiccuped from 1922 to 1990.",
  "Your body produces about 25 million new cells each second.",
  "A mantis shrimp can punch with the force of a .22 caliber bullet and can accelerate its claw faster than a bullet.",
  "If you could fold a piece of paper 42 times, it would be thick enough to reach the Moon.",
  "The longest place name still in use is a hill in New Zealand: Taumata­whaka­tangi­hanga­koauau­o­tamatea­turi­pukaka­piki­maunga­horo­nuku­pokai­whenua­ki­tana­tahu.",
  "Venus is the only planet in our solar system that spins clockwise.",
  "The fingerprints of koalas are so similar to humans' that they have occasionally been confused at crime scenes.",
  "An average person walks the equivalent of five times around the Earth in their lifetime.",
  "Broccoli is a human-made plant — it was bred from wild cabbage by Italian farmers starting around the 6th century BCE.",
  "A single lightning bolt can contain enough energy to toast about 100,000 slices of bread.",
  "Hot water freezes faster than cold water under certain conditions. This is known as the Mpemba effect.",
  "Cats have over 20 different vocalizations, including the purr, which vibrates at a frequency that can promote bone healing.",
  "The total length of your circulatory system — arteries, veins, and capillaries — is about 60,000 miles.",
  "A flea can jump up to 150 times its own body length, making it one of the best jumpers relative to its size.",
  "The speed of a computer mouse is measured in units called 'Mickeys'.",
  "Dragonflies have been on Earth for about 300 million years and once had wingspans of up to 2.5 feet.",
  "A group of crows is called a 'murder'.",
  "The smell of freshly cut grass is actually a plant distress signal — chemicals released by the grass to alert nearby plants.",
  "The average person spends about 6 months of their lifetime waiting for red traffic lights to change.",
  "Your brain uses about 20% of your body's total oxygen and calorie intake despite being only about 2% of your body weight.",
  "The deepest point in the ocean, the Mariana Trench, is deeper than Mount Everest is tall.",
  "A single Google search uses roughly the same amount of energy needed to light a 60-watt bulb for 17 seconds.",
  "Glaciers and ice sheets hold about 69% of the world's freshwater.",
  "The world's oldest known living tree is a bristlecone pine in California named Methuselah, over 4,800 years old.",
  "Sound travels about 4.3 times faster in water than in air.",
  "A cockroach can live for about a week without its head before dying of dehydration.",
  "The average human body carries about 2 to 6 pounds of bacteria.",
  "If the Sun were the size of a front door, Earth would be the size of a nickel.",
  "Your stomach acid is strong enough to dissolve metal. Your stomach lining renews itself every 3 to 4 days to prevent self-digestion.",
  "Dolphins sleep with one eye open and only half their brain at a time so they can keep breathing.",
  "The first oranges weren't orange — the original oranges from Southeast Asia were actually green.",
  "It would take about 1.2 million mosquitoes, all sucking at once, to completely drain the blood from an average human.",
  "A hummingbird weighs less than a nickel.",
  "The longest English word without a vowel is 'rhythms'.",
  "A newborn kangaroo is about the size of a lima bean.",
  "The inventor of the fire hydrant is unknown because the patent was destroyed in a fire.",
  "There are more public libraries in the United States than McDonald's restaurants.",
  "Almonds are members of the peach family.",
  "Pigeons can do math. Studies have shown they can learn abstract numerical rules and rank groups by number.",
  "The lighter was invented before the match. The first lighter appeared around 1823; friction matches came in 1826.",
  "A bolt of lightning can reach temperatures of roughly 30,000 Kelvin — about five times the surface temperature of the Sun.",
  "If you unraveled all the DNA in your body, it would stretch about twice the diameter of the solar system.",
  "Apples float in water because they are about 25% air.",
  "The Guinness Book of World Records was originally created to settle bar arguments.",
  "A snail can sleep for up to three years.",
  "The average person blinks about 15 to 20 times per minute — that's up to 28,000 times a day.",
  "Humans are the only animals known to blush.",
  "An electric eel can produce up to 860 volts of electricity — enough to stun a horse.",
  "There are about 10 quintillion (10,000,000,000,000,000,000) insects alive on Earth at any given time.",
  "The oldest known joke is a Sumerian proverb from about 1900 BCE, and it's a fart joke.",
  "Adult cats only meow to communicate with humans — they don't meow at each other.",
  "The moon has moonquakes, caused by gravitational tidal forces from the Earth.",
  "A grizzly bear's bite is strong enough to crush a bowling ball.",
  "Water can boil and freeze at the same time under specific conditions, known as the 'triple point'.",
  "The total surface area of your lungs is roughly the size of a tennis court.",
  "Crows can remember human faces and hold grudges against people who have threatened them.",
  "A day on Mercury lasts 59 Earth days, but a year on Mercury is only 88 Earth days.",
  "Peanuts are not nuts — they're legumes and grow underground.",
  "The human skeleton is completely replaced roughly every 10 years through continuous bone remodeling.",
  "Tardigrades, also called water bears, can survive in the vacuum of space, extreme radiation, and temperatures from near absolute zero to 300°F.",
  "A group of owls is called a 'parliament'.",
  "There are more ways to shuffle a standard deck of 52 playing cards than there are atoms on Earth.",
  "Turtles can breathe through their butts — a process called cloacal respiration.",
  "If you drove at 60 mph straight up, you'd reach space in about an hour.",
  "The average adult human body contains enough iron to make a 3-inch nail.",
  "Antarctica is the driest continent on Earth — parts of it haven't seen rain in nearly 2 million years.",
  "Your cornea is one of only two parts of the body with no blood supply — it gets oxygen directly from the air.",
  "Honey bees must visit about 2 million flowers to make one pound of honey.",
  "The Olympic gold medal is actually over 92% silver with a thin gold coating.",
  "Vending machines are statistically more dangerous than sharks — they cause more deaths per year.",
  "The surface area of Russia is larger than the surface area of Pluto.",
  "Newborn babies can only see in black and white for the first few months of life.",
  "A strawberry isn't actually a berry — it's an 'accessory fruit' because the seeds are on the outside.",
  "The inventor of the microwave oven discovered the technology when a chocolate bar melted in his pocket near radar equipment.",
  "Spiders can't fly, but they can 'balloon' — they release silk threads and ride air currents for hundreds of miles.",
  "A chameleon's tongue can be twice the length of its body and strikes prey in about 0.07 seconds.",
  "Humans glow in the dark — we emit bioluminescent light, but it's 1,000 times weaker than what our eyes can detect.",
  "Lake Superior contains enough water to cover all of North and South America in one foot of water.",
  "A platypus doesn't have a stomach — food goes straight from the esophagus to the intestine.",
  "The average cumulonimbus thundercloud is about 6 miles tall.",
  "There are about 8.7 million species on Earth, but over 80% of them are still undiscovered.",
  "A day on Pluto lasts about 6.4 Earth days.",
  "The world's largest desert is actually Antarctica — deserts are defined by precipitation, not temperature.",
  "Your body has more bacterial cells than human cells — roughly 38 trillion bacteria to 30 trillion human cells.",
  "The Great Barrier Reef is the largest living structure on Earth and is visible from space.",
  "Bees can detect bombs. They can be trained to associate the scent of explosives with food rewards.",
  "A group of jellyfish is called a 'smack'.",
  "Your bones are about 5 times stronger than steel of the same weight.",
  "The longest recorded flight of a chicken is 13 seconds.",
  "If you squeezed all the empty space out of every atom in every human, the entire human race would fit in a sugar cube.",
  "The Sun makes up about 99.86% of all the mass in the entire solar system.",
  "Dolphins have names for each other and respond when called by their specific whistle.",
  "The shortest complete sentence in the English language is 'I am.' or arguably 'Go.'",
  "There's a species of jellyfish, Turritopsis dohrnii, that is biologically immortal — it can revert to its juvenile form.",
  "The Amazon rainforest produces about 20% of the world's oxygen.",
  "Glass is neither a solid nor a liquid — it's an amorphous solid, stuck between the two states.",
  "A hippopotamus can run faster than a human — they can reach speeds up to 19 mph on land.",
  "The world's largest snowflake on record was 15 inches wide and 8 inches thick, found in Montana in 1887.",
  "A jiffy in physics means the time it takes light to travel one centimeter — about 33.3 picoseconds.",
  "Elephants can sense a rainstorm from 150 miles away.",
  "The average human body produces enough saliva in a lifetime to fill two swimming pools.",
  "Rats laugh when they are tickled — they produce a high-pitched ultrasonic chirping sound.",
  "The largest organism on Earth is a honey fungus in Oregon spanning about 2,385 acres.",
  "The average human will shed about 40 pounds of skin in their lifetime.",
  "In the time it takes you to read this sentence, your body has produced about 25 million red blood cells.",
  "Cuttlefish have three hearts, blue-green blood, and W-shaped pupils.",
  "A photon that left the Sun 8 minutes ago was created in the Sun's core about 100,000 years ago.",
  "The GPS system has to account for Einstein's theory of relativity — without corrections, it would drift by about 6 miles per day.",
  "Pistol shrimp snap their claws so fast they create a bubble that reaches 4,700°C — nearly as hot as the Sun's surface.",
  "Approximately 90% of the cells in your body are microorganisms, not human cells.",
  "It would take about 1,000 years to watch every video currently on YouTube.",
  "A group of pugs is called a 'grumble'.",
  "The Earth's rotation is gradually slowing down — about 600 million years ago, a day was only 21 hours long.",
  "Humans are born with about 300 bones, but adults only have 206 because many fuse together during growth.",
  "The average lightning bolt is about 2 to 3 miles long but only about an inch wide.",
  "A cockroach can run up to 3 miles per hour, making it one of the fastest insects relative to its size.",
  "Bamboo can grow up to 35 inches in a single day, making it the fastest-growing plant on Earth.",
  "The footprint of an Apollo spacecraft on the Moon is about the same size as a footprint at the beach.",
  "Your eyes can distinguish approximately 10 million different colors.",
  "A group of cats is called a 'clowder'.",
  "The longest time between two twins being born is 87 days apart.",
  "Giraffes have the same number of neck vertebrae as humans — seven. Their vertebrae are just much larger.",
  "Approximately 1% of the static on an old, untuned TV is actually residual radiation from the Big Bang.",
  "A single teaspoon of soil contains more microorganisms than there are people on Earth.",
  "The shortest scheduled airline flight in the world is 1.7 miles — between the islands of Westray and Papa Westray in Scotland, lasting about 90 seconds.",
  "Grasshoppers have ears in their bellies — their auditory organs are on their abdomen.",
  "Sunflowers follow the Sun across the sky during the day through a process called heliotropism. Mature sunflowers face east permanently.",
  "A bolt of lightning contains roughly one billion joules of energy.",
  "The longest word you can type using only the top row of a QWERTY keyboard is 'typewriter'.",
  "Oysters can change their gender multiple times throughout their life.",
  "The shortest street in the world is Ebenezer Place in Scotland, measuring only 6 feet 9 inches long.",
  "A single rain cloud can hold billions of pounds of water.",
  "You lose up to 30% of your taste buds during a flight, which is partly why airplane food tastes bland.",
  "There are about 3 trillion trees on Earth — roughly 400 trees for every person alive.",
  "The Earth is hit by about 17 meteors every day, though most burn up in the atmosphere.",
  "Crows have been observed making and using tools, such as bending wire to hook food.",
  "Your body has about 600 muscles — the smallest is the stapedius in your ear, about 1 millimeter long.",
  "The Great Pyramid of Giza was the tallest man-made structure in the world for nearly 3,800 years.",
  "Kangaroos can't walk backwards.",
  "Starfish don't have brains — they use a decentralized nervous system spread throughout their arms.",
  "Greenland sharks can live over 400 years, making them the longest-living vertebrates known.",
  "The average person produces enough gas daily to fill a small balloon.",
  "An individual blood cell takes about 60 seconds to make a complete circuit through your body.",
  "A blue whale's heartbeat can be detected from over 2 miles away.",
  "Raspberries, blackberries, and mulberries are not technically berries — they are 'aggregate fruits'.",
  "NASA's Space Shuttle used more than 2.5 million individual parts.",
  "Ostriches can run faster than horses, reaching speeds up to 45 mph.",
  "Your hair grows faster in warm weather because heat stimulates the hair follicles.",
  "Lobsters have blue blood because they use copper-based hemocyanin instead of iron-based hemoglobin.",
  "The number of possible unique orders for a deck of 52 cards is roughly 8 × 10^67 — more than the number of atoms in the Milky Way.",
  "The 'smell of rain' has a name — it's called 'petrichor', caused by oils released by plants during dry periods.",
  "A typical cumulus cloud weighs about 1.1 million pounds.",
  "Horses can't breathe through their mouths — they are obligate nose-breathers.",
  "Astronauts grow about 2 inches taller in space because their spines expand without gravity compressing them.",
  "A group of butterflies is called a 'kaleidoscope'.",
  "Saturn would float if you could find a body of water large enough — its density is lower than water's.",
  "There are more fake flamingos in the world than real ones.",
  "Your small intestine is about 20 feet long — roughly four times your height.",
  "The word 'nerd' was first coined by Dr. Seuss in the book 'If I Ran the Zoo' in 1950.",
  "Dolphins can stay awake for 15 consecutive days by alternating which half of their brain sleeps.",
  "A full head of human hair is strong enough to support the weight of two elephants.",
  "Avocados are toxic to birds, horses, and many other animals — the compound persin is harmless to humans but dangerous to them.",
  "The Sahara Desert is roughly the same size as the entire United States.",
  "A single bolt of lightning can power a small town for an entire day.",
  "Octopuses have copper-based blue blood, three hearts, and can squeeze through any gap larger than their beak.",
  "Your brain generates about 12 to 25 watts of electricity while awake — enough to power a small LED light bulb.",
  "The longest hiccup attack ever recorded lasted from 1922 to 1990 — a total of 68 years."
]